In [1]:
import pandas as pd

### 데이터 구조(data structure : 데이터를 저장해두는 구조)와  타입(data type : 정수(int(32/64bit)), 소수점(float(32/64bit)), 문자열(string(x) -> object로 표현), Date, Category 등)이 판다스의 기본
16bit란 개념이 존재하기도 함. 64bit 보다 32bit가 빠르긴 하니 나중에 고려하면 좋을 듯...

### 데이터구조(DataStructure)
    1. Series : 판다스의 가장 기본적인 구조
    2. DataFrame 이 판다스의 핵심 이를 중요하는 하나가 Series다.

### Series 
(수학적으로 벡터와 유사)

In [2]:
odd = [1, 3, 5, 7, 9]
odd = pd.Series(odd)
odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

### DataFrame 
(수학적으로 행렬과 유사) : 여러개의 series(행 하나하나, 열 하나하나가 series)가 모여서 만듦

In [3]:
numbers = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9],
]

numbers = pd.DataFrame(numbers)
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
print(type(numbers))

# numbers[0] # 컬럼검색
print(type(numbers[0]))

# numbers.loc[0] # 로우 검색
print(type(numbers.loc[0]))

numbers

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

## DataType

In [5]:
data = pd.Series([1, 3, 5, 7, 9])

print(data.dtypes) # 데이터가 모두 같을 때 dtype으로 써서 볼 수 
data.head()

int64

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [6]:
data = pd.Series([1, 3, 5, 7.0, 9])

print(data.dtypes) # 데이터가 하나라도 소수점일땐 정수를 포함할 수 있는 소수점으로 나타냄
data.head()

float64

0    1.0
1    3.0
2    5.0
3    7.0
4    9.0
dtype: float64

In [7]:
data = pd.Series([1, 3, 5, 7.0, 9, 'hello'])

print(data.dtypes) # 데이터가 하나라도 문자열이라면 정수, 소수점 등을 표현할 수 있는 문자열로 나타남, 거의 대부분을 object가 포함
data.head()

object

0    1
1    3
2    5
3    7
4    9
dtype: object

In [8]:
import numpy as np

#NaN(Not a Number), null -> 값이 비어있으면(NaN) float형태라 생각하면 된다. 
#빈 값은 NaN으로 넣고 0이나 -1같은 걸로 채우면 나중에 그 값이 할당되면 뭐가 뭔지 모르게 된다.
data = pd.Series([1, np.nan, 5, 7, 9])

print(data.dtypes)
data.head()

float64

0    1.0
1    NaN
2    5.0
3    7.0
4    9.0
dtype: float64

In [9]:
data = pd.Series([1, 3, 5, 7, 9])

print(data.dtype)
print("--------")

data = data.astype('float') # astype으로 형을 바꿔줄 수 있음
# data = data.astype(np.float32) # float32, 64 다 가능.. 보통은 위에껄 많이 씀

data

int64
--------

0    1.0
1    3.0
2    5.0
3    7.0
4    9.0
dtype: float64

### DataFrame
모든게 dataframe 에서 시작해서 끝난다고 생각하면 된다.. 만드는 방법도 다양~~~~

In [10]:
transaction = [
    ['2017-01-01', 500, 'confirmed'], 
    ['2017-01-03', 700, 'confirmed'], 
    ['2017-01-10', 200, 'canceled'], 
]
# 원래 열 이름은 series여서 0, 1, 2로 되는데 이걸 date등으로 바꿈
transaction = pd.DataFrame(transaction, columns=["date", "price", "state"])
transaction

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

In [11]:
transaction = {
    'date' : ['2017-01-01', '2017-01-03', '2017-01-10'], 
    'price' : [500, 700, 200],
    'state' : ['confirmed', 'confirmed', 'canceled']
}

transaction = pd.DataFrame(transaction)
transaction

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

In [12]:
# 가장 보편적인 방법
transaction = [
    {'date' : '2017-01-01', 'price' : 500, 'state' : 'confirmed'},
    {'date' : '2017-01-03', 'price' : 700, 'state' : 'confirmed'},
    {'date' : '2017-01-10', 'price' : 200, 'state' : 'canceled'},
]

transaction = pd.DataFrame(transaction)
transaction

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

### 기본 기능

In [13]:
transaction = [
    {'date' : '2017-01-01', 'price' : 500, 'state' : 'confirmed'},
    {'date' : '2017-01-03', 'price' : 700, 'state' : 'confirmed'},
    {'date' : '2017-01-05', 'price' : 800, 'state' : 'confirmed'},
    {'date' : '2017-01-07', 'price' : 500, 'state' : 'canceled'},
    {'date' : '2017-01-09', 'price' : 700, 'state' : 'confirmed'},
    {'date' : '2017-01-10', 'price' : 200, 'state' : 'canceled'},
]

index_list = [
    "Kang", "Kim", "Choi", "Park", "Lee", "Yoon",
]

transaction = pd.DataFrame(transaction, index = index_list)
transaction

            date  price      state
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-05    800  confirmed
Park  2017-01-07    500   canceled
Lee   2017-01-09    700  confirmed
Yoon  2017-01-10    200   canceled

In [14]:
transaction.head() #기본적으로 5개를 띄우는데, head(1)은 1개만, (2)는 2개.. 이렇게 띄움

            date  price      state
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-05    800  confirmed
Park  2017-01-07    500   canceled
Lee   2017-01-09    700  confirmed

In [15]:
transaction.tail()

            date  price      state
Kim   2017-01-03    700  confirmed
Choi  2017-01-05    800  confirmed
Park  2017-01-07    500   canceled
Lee   2017-01-09    700  confirmed
Yoon  2017-01-10    200   canceled

In [16]:
#index : 0, 1, 2, 3... 세로줄
#column : date, price..가로줄
#가운데 : values
transaction.columns
# () 를 열고닫는 건 함수, ()가 없는건 변수라고 생각하면 된다.

Index(['date', 'price', 'state'], dtype='object')

In [17]:
print(transaction.index.values)
print(type(transaction.index.values))

type(transaction.index) #리스트로 넣었지만 타입은 index... 호환이 안된다 왜???

['Kang' 'Kim' 'Choi' 'Park' 'Lee' 'Yoon']
<class 'numpy.ndarray'>

pandas.core.indexes.base.Index

In [18]:
transaction.values

array([['2017-01-01', 500, 'confirmed'],
       ['2017-01-03', 700, 'confirmed'],
       ['2017-01-05', 800, 'confirmed'],
       ['2017-01-07', 500, 'canceled'],
       ['2017-01-09', 700, 'confirmed'],
       ['2017-01-10', 200, 'canceled']], dtype=object)

In [19]:
type(transaction.values) # numpy로 바꿔주는 것을 values라고 한다.

numpy.ndarray

In [20]:
transaction.describe() #개수, 평균, 표준편차, 최소, 25%, 50%, 75%, 최대

            price
count    6.000000
mean   566.666667
std    216.024690
min    200.000000
25%    500.000000
50%    600.000000
75%    700.000000
max    800.000000

In [21]:
transaction

            date  price      state
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-05    800  confirmed
Park  2017-01-07    500   canceled
Lee   2017-01-09    700  confirmed
Yoon  2017-01-10    200   canceled

In [22]:
transaction.columns = ["date", "amount", "result"] #column변경

transaction

            date  amount     result
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-05     800  confirmed
Park  2017-01-07     500   canceled
Lee   2017-01-09     700  confirmed
Yoon  2017-01-10     200   canceled

In [23]:
#transaction.columns.difference #하나만 바꾸는거... 나중에.. 까먹으셨음
print(type(transaction.index))
print(type(transaction.columns))
# 타입은 같은데 안에 들어가있는게 조금 다를 뿐
# 컬럼 이름을 하나만 바꿀때는 rename을 쓰면 된다.

<class 'pandas.core.indexes.base.Index'>
<class 'pandas.core.indexes.base.Index'>

### 정렬하기

In [24]:
# index / 안에있는 값 으로 정렬하는 방법 2가지
# transaction.sort_index() 이거 자체만으로는 저장이 안되서 변수에 넣어줘야 저장이 됨.
transaction = transaction.sort_index() #정렬한 결과값을 반환하는 것. 생겨서 원본, 변환값 두개가 생김
transaction

            date  amount     result
Choi  2017-01-05     800  confirmed
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Lee   2017-01-09     700  confirmed
Park  2017-01-07     500   canceled
Yoon  2017-01-10     200   canceled

In [25]:
transaction.sort_index(ascending=False) #순서 뒤집기

            date  amount     result
Yoon  2017-01-10     200   canceled
Park  2017-01-07     500   canceled
Lee   2017-01-09     700  confirmed
Kim   2017-01-03     700  confirmed
Kang  2017-01-01     500  confirmed
Choi  2017-01-05     800  confirmed

In [26]:
transaction.sort_index(ascending=False, inplace=True) #inplace가 sort_index만 쓴거랑 같은 결과를 나타냄
transaction

            date  amount     result
Yoon  2017-01-10     200   canceled
Park  2017-01-07     500   canceled
Lee   2017-01-09     700  confirmed
Kim   2017-01-03     700  confirmed
Kang  2017-01-01     500  confirmed
Choi  2017-01-05     800  confirmed

In [27]:
transaction.sort_index(axis=0)  #row 정렬

            date  amount     result
Choi  2017-01-05     800  confirmed
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Lee   2017-01-09     700  confirmed
Park  2017-01-07     500   canceled
Yoon  2017-01-10     200   canceled

In [28]:
transaction = transaction.sort_index(axis=1) #column 정렬
transaction

      amount        date     result
Yoon     200  2017-01-10   canceled
Park     500  2017-01-07   canceled
Lee      700  2017-01-09  confirmed
Kim      700  2017-01-03  confirmed
Kang     500  2017-01-01  confirmed
Choi     800  2017-01-05  confirmed

In [29]:
transaction.sort_values(by="amount")

      amount        date     result
Yoon     200  2017-01-10   canceled
Park     500  2017-01-07   canceled
Kang     500  2017-01-01  confirmed
Lee      700  2017-01-09  confirmed
Kim      700  2017-01-03  confirmed
Choi     800  2017-01-05  confirmed

In [30]:
transaction.sort_values(by="amount", ascending=False) #ascending : 순서 뒤집기

      amount        date     result
Choi     800  2017-01-05  confirmed
Lee      700  2017-01-09  confirmed
Kim      700  2017-01-03  confirmed
Park     500  2017-01-07   canceled
Kang     500  2017-01-01  confirmed
Yoon     200  2017-01-10   canceled

In [31]:
transaction["result"].value_counts() #꽤 요긴하게 쓰임, 뭐가 몇개있고 이런걸 나타낼때 쓰임

confirmed    4
canceled     2
Name: result, dtype: int64

### 기본 연산

In [32]:
mean_amount = transaction["amount"].mean()
min_amount = transaction["amount"].min()
max_amount = transaction["amount"].max()

mean_amount, min_amount, max_amount

(566.6666666666666, 200, 800)

In [33]:
# transaction["amount"].shift() #앞에 한칸씩 땡겨주는 것(시간적으로 관련된 데이터를 정렬할때 쓰인다.) 
transaction["prev-amount"] = transaction["amount"].shift(+1)
transaction["next-amount"] = transaction["amount"].shift(-1)
transaction

      amount        date     result  prev-amount  next-amount
Yoon     200  2017-01-10   canceled          NaN        500.0
Park     500  2017-01-07   canceled        200.0        700.0
Lee      700  2017-01-09  confirmed        500.0        700.0
Kim      700  2017-01-03  confirmed        700.0        500.0
Kang     500  2017-01-01  confirmed        700.0        800.0
Choi     800  2017-01-05  confirmed        500.0          NaN

In [34]:
transaction["amount-diff"] = transaction["amount"].diff()
transaction

      amount        date     result  prev-amount  next-amount  amount-diff
Yoon     200  2017-01-10   canceled          NaN        500.0          NaN
Park     500  2017-01-07   canceled        200.0        700.0        300.0
Lee      700  2017-01-09  confirmed        500.0        700.0        200.0
Kim      700  2017-01-03  confirmed        700.0        500.0          0.0
Kang     500  2017-01-01  confirmed        700.0        800.0       -200.0
Choi     800  2017-01-05  confirmed        500.0          NaN        300.0

### 행렬 접근

In [35]:
print(type(transaction["date"]))
transaction

<class 'pandas.core.series.Series'>

      amount        date     result  prev-amount  next-amount  amount-diff
Yoon     200  2017-01-10   canceled          NaN        500.0          NaN
Park     500  2017-01-07   canceled        200.0        700.0        300.0
Lee      700  2017-01-09  confirmed        500.0        700.0        200.0
Kim      700  2017-01-03  confirmed        700.0        500.0          0.0
Kang     500  2017-01-01  confirmed        700.0        800.0       -200.0
Choi     800  2017-01-05  confirmed        500.0          NaN        300.0

In [36]:
print(type(transaction[["date", "amount"]])) #이쁘면 dataframe, 안이쁘면 series
transaction[["date", "amount"]]

<class 'pandas.core.frame.DataFrame'>

            date  amount
Yoon  2017-01-10     200
Park  2017-01-07     500
Lee   2017-01-09     700
Kim   2017-01-03     700
Kang  2017-01-01     500
Choi  2017-01-05     800

In [37]:
print(type(transaction.loc["Kang"]))
transaction.loc["Kang"] #row를 가져올 수 있고 안예뻐보이니 series

<class 'pandas.core.series.Series'>

amount                500
date           2017-01-01
result          confirmed
prev-amount           700
next-amount           800
amount-diff          -200
Name: Kang, dtype: object

In [38]:
print(type(transaction.loc[["Kang", "Kim", "Choi"]]))
transaction.loc[["Kang", "Kim", "Choi"]]

<class 'pandas.core.frame.DataFrame'>

      amount        date     result  prev-amount  next-amount  amount-diff
Kang     500  2017-01-01  confirmed        700.0        800.0       -200.0
Kim      700  2017-01-03  confirmed        700.0        500.0          0.0
Choi     800  2017-01-05  confirmed        500.0          NaN        300.0

In [39]:
print(type(transaction["Kim" : "Yoon"]))
transaction["Kim" : "Yoon"]

<class 'pandas.core.frame.DataFrame'>

Empty DataFrame
Columns: [amount, date, result, prev-amount, next-amount, amount-diff]
Index: []

In [40]:
# transaction["amount"] #series
transaction[["amount"]] #dataframe

      amount
Yoon     200
Park     500
Lee      700
Kim      700
Kang     500
Choi     800

### 행렬 동시 접근

In [41]:
transaction["date"]["Kang"] #행렬을 접근하는 방법 중에 가장 안 좋은 방식
# %timeit transaction["date"]["Kang"] << 이걸로 접근하는 시간을 판단할 수 있음

'2017-01-01'

In [42]:
transaction.loc["Kang", "date"] #함수를 한 번 호출한 셈이니 위에서 두번 호출 한것보다 빠르다

'2017-01-01'

In [43]:
transaction.at["Kang", "date"] 
#loc 는 열을 가져오는 기능도 포함되지만, at은 행렬 동시에 가져오는 최적화된 메소드이기 때문에 제일 빠름
#하나 이상이 되는 순간은 쓸 수 없기 때문에 loc를 써야한다. -> .at[["Kang", "Kim"], "date"] 불가

'2017-01-01'

In [44]:
transaction.loc[["Kang", "Kim", "Choi"], ["date", "amount"]]

            date  amount
Kang  2017-01-01     500
Kim   2017-01-03     700
Choi  2017-01-05     800

In [45]:
transaction.iloc[0] #순서상으로 접근하기 위한 방법

amount                200
date           2017-01-10
result           canceled
prev-amount           NaN
next-amount           500
amount-diff           NaN
Name: Yoon, dtype: object

In [46]:
transaction.iloc[0, 0]

200

In [47]:
transaction.iat[0, 0] #하나의 데이터만 가능하므로 두개 이상은 iloc로 사용

200

### 색인

In [48]:
transaction[transaction["date"] == "2017-01-01"]

      amount        date     result  prev-amount  next-amount  amount-diff
Kang     500  2017-01-01  confirmed        700.0        800.0       -200.0

In [49]:
transaction[transaction["date"] != "2017-01-01"]

      amount        date     result  prev-amount  next-amount  amount-diff
Yoon     200  2017-01-10   canceled          NaN        500.0          NaN
Park     500  2017-01-07   canceled        200.0        700.0        300.0
Lee      700  2017-01-09  confirmed        500.0        700.0        200.0
Kim      700  2017-01-03  confirmed        700.0        500.0          0.0
Choi     800  2017-01-05  confirmed        500.0          NaN        300.0

In [50]:
# and(&), or(|)
# transaction[(transaction["result"] == "confirmed") & (transaction["amount"] >= 500)]

# 위 아래 같은 결과

confirmed = transaction["result"] == "confirmed"
high_paid = transaction["amount"] >= 500

transaction[confirmed & high_paid]

      amount        date     result  prev-amount  next-amount  amount-diff
Lee      700  2017-01-09  confirmed        500.0        700.0        200.0
Kim      700  2017-01-03  confirmed        700.0        500.0          0.0
Kang     500  2017-01-01  confirmed        700.0        800.0       -200.0
Choi     800  2017-01-05  confirmed        500.0          NaN        300.0

### Apply

In [51]:
# 판다스에서 파이썬을 쓰기 위핸 좋은 방법 : apply
def isvip(amount) :
    return amount >= 500

transaction["VIP"] = transaction["amount"].apply(isvip)
transaction

,amount,date,result,prev-amount,next-amount,amount-diff,VIP
Yoon,200,2017-01-10,canceled,NaN,500.0,NaN,False
Park,500,2017-01-07,canceled,200.0,700.0,300.0,True
Lee,700,2017-01-09,confirmed,500.0,700.0,200.0,True
Kim,700,2017-01-03,confirmed,700.0,500.0,0.0,True
Kang,500,2017-01-01,confirmed,700.0,800.0,-200.0,True
Choi,800,2017-01-05,confirmed,500.0,NaN,300.0,True

In [52]:
# 함수를 굳이 만들고 싶지 않을 때, 복잡하게 쓰고 싶지 않을 때 그냥 "람다" 사용
transaction["VIP"] = transaction["amount"].apply(lambda amount : amount >= 500)
transaction

,amount,date,result,prev-amount,next-amount,amount-diff,VIP
Yoon,200,2017-01-10,canceled,NaN,500.0,NaN,False
Park,500,2017-01-07,canceled,200.0,700.0,300.0,True
Lee,700,2017-01-09,confirmed,500.0,700.0,200.0,True
Kim,700,2017-01-03,confirmed,700.0,500.0,0.0,True
Kang,500,2017-01-01,confirmed,700.0,800.0,-200.0,True
Choi,800,2017-01-05,confirmed,500.0,NaN,300.0,True

In [53]:
def isvip(row) :
    amount = row["amount"]
    result = row["result"]
    
    return result == "confirmed" and amount >= 500

# axit 0 -> row, 1 -> column이랑 연관된 것.
transaction["VIP"] = transaction.apply(isvip, axis=1)
transaction

,amount,date,result,prev-amount,next-amount,amount-diff,VIP
Yoon,200,2017-01-10,canceled,NaN,500.0,NaN,False
Park,500,2017-01-07,canceled,200.0,700.0,300.0,False
Lee,700,2017-01-09,confirmed,500.0,700.0,200.0,True
Kim,700,2017-01-03,confirmed,700.0,500.0,0.0,True
Kang,500,2017-01-01,confirmed,700.0,800.0,-200.0,True
Choi,800,2017-01-05,confirmed,500.0,NaN,300.0,True

### 컬럼 추가하기 && 수정하기

In [54]:
transaction["card-holder"] = "KB Card"
transaction

,amount,date,result,prev-amount,next-amount,amount-diff,VIP,card-holder
Yoon,200,2017-01-10,canceled,NaN,500.0,NaN,False,KB Card
Park,500,2017-01-07,canceled,200.0,700.0,300.0,False,KB Card
Lee,700,2017-01-09,confirmed,500.0,700.0,200.0,True,KB Card
Kim,700,2017-01-03,confirmed,700.0,500.0,0.0,True,KB Card
Kang,500,2017-01-01,confirmed,700.0,800.0,-200.0,True,KB Card
Choi,800,2017-01-05,confirmed,500.0,NaN,300.0,True,KB Card

In [55]:
transaction["order"] = [1, 2, 3, 4, 5, 6] # 숫자만 맞으면 뭐든 넣을 수 있음
transaction

,amount,date,result,prev-amount,next-amount,amount-diff,VIP,card-holder,order
Yoon,200,2017-01-10,canceled,NaN,500.0,NaN,False,KB Card,1
Park,500,2017-01-07,canceled,200.0,700.0,300.0,False,KB Card,2
Lee,700,2017-01-09,confirmed,500.0,700.0,200.0,True,KB Card,3
Kim,700,2017-01-03,confirmed,700.0,500.0,0.0,True,KB Card,4
Kang,500,2017-01-01,confirmed,700.0,800.0,-200.0,True,KB Card,5
Choi,800,2017-01-05,confirmed,500.0,NaN,300.0,True,KB Card,6

In [56]:
transaction.loc[transaction["amount"] >= 500, "VIP"] = True
transaction.loc[transaction["amount"] < 500, "VIP"] = False
transaction

,amount,date,result,prev-amount,next-amount,amount-diff,VIP,card-holder,order
Yoon,200,2017-01-10,canceled,NaN,500.0,NaN,False,KB Card,1
Park,500,2017-01-07,canceled,200.0,700.0,300.0,True,KB Card,2
Lee,700,2017-01-09,confirmed,500.0,700.0,200.0,True,KB Card,3
Kim,700,2017-01-03,confirmed,700.0,500.0,0.0,True,KB Card,4
Kang,500,2017-01-01,confirmed,700.0,800.0,-200.0,True,KB Card,5
Choi,800,2017-01-05,confirmed,500.0,NaN,300.0,True,KB Card,6

In [58]:
transaction.dtypes

amount           int64
date            object
result          object
prev-amount    float64
next-amount    float64
amount-diff    float64
VIP               bool
card-holder     object
order            int64
dtype: object

In [59]:
type(transaction["date"])

pandas.core.series.Series